In [61]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
df=pd.read_csv('titanic.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [66]:
df['Age'].isnull().values.any()

True

In [67]:
df['Age'].isnull().sum()

177

In [68]:
df.Age = df.Age.fillna(df.Age.mean())

In [69]:
df['Age'].isnull().values.any()

False

In [70]:
df.groupby('Survived').mean()

          PassengerId    Pclass        Age     SibSp     Parch       Fare
Survived
0          447.016393  2.531876  30.415100  0.553734  0.329690  22.117887
1          444.368421  1.950292  28.549778  0.473684  0.464912  48.395408

In [71]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [72]:
inputs=df.drop(['PassengerId','Survived','Name','SibSp','Parch','Ticket', 'Cabin','Embarked'],axis='columns')
inputs

     Pclass     Sex        Age     Fare
0         3    male  22.000000   7.2500
1         1  female  38.000000  71.2833
2         3  female  26.000000   7.9250
3         1  female  35.000000  53.1000
4         3    male  35.000000   8.0500
..      ...     ...        ...      ...
886       2    male  27.000000  13.0000
887       1  female  19.000000  30.0000
888       3  female  29.699118  23.4500
889       1    male  26.000000  30.0000
890       3    male  32.000000   7.7500

[891 rows x 4 columns]

In [73]:
target=df['Survived']
target

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

**Changing the nominal columns to dummies**

In [74]:
from sklearn.preprocessing import LabelEncoder

In [75]:
le_sex=LabelEncoder()

In [76]:
inputs['sex_n']=le_sex.fit_transform(inputs['Sex'])

In [1]:
inputs_n=inputs.drop(['sex_n'],axis='columns')
inputs_n

NameError: name 'inputs' is not defined

In [78]:
from sklearn.model_selection import train_test_split

In [79]:
x_train,x_test,y_train,y_test=train_test_split(inputs_n,target,test_size=0.2)

In [80]:
x_test

     Pclass        Age      Fare  sex_n
247       2  24.000000   14.5000      0
200       3  28.000000    9.5000      1
111       3  14.500000   14.4542      0
119       3   2.000000   31.2750      0
629       3  29.699118    7.7333      1
..      ...        ...       ...    ...
555       1  62.000000   26.5500      1
105       3  28.000000    7.8958      1
58        2   5.000000   27.7500      0
393       1  23.000000  113.2750      0
844       3  17.000000    8.6625      1

[179 rows x 4 columns]

In [81]:
from sklearn import tree

In [82]:
model=tree.DecisionTreeClassifier()

In [83]:
model.fit(x_train,y_train)

DecisionTreeClassifier()

In [85]:
model.score(x_test, y_test)

0.7988826815642458